# Pandas

In [2]:
import pandas as pd
import numpy as np

In [3]:
data = {
    'name' : 'John',
    'sex' : 'male',
    'age' : 22
}
john_s = pd.Series(data)
print(john_s)

name    John
sex     male
age       22
dtype: object

In [4]:
pd.Series(data)

name    John
sex     male
age       22
dtype: object

In [3]:
array = np.array([100, 200, 300])
pd.Series(array)

0    100
1    200
2    300
dtype: int64

In [4]:
array = np.array([100, 200, 300])
labels = ['a', 'b', 'c']
pd.Series(array, labels)

a    100
b    200
c    300
dtype: int64

In [5]:
data = {
    'name':'John',
    'sex':'male',
    'age':22
}
john_s = pd.Series(data)
print(john_s['age'])

22

In [6]:
import numpy as np
ndarray = np.random.randint(5, size=(5, 4))
pd.DataFrame(data=ndarray)

   0  1  2  3
0  4  4  4  4
1  2  1  2  4
2  1  4  2  0
3  3  0  4  0
4  0  2  4  4

In [7]:
columns = ['a', 'b', 'c', 'd']
index = np.arange(0, 50, 10)
pd.DataFrame(data=ndarray, index=index, columns=columns)

    a  b  c  d
0   4  4  4  4
10  2  1  2  4
20  1  4  2  0
30  3  0  4  0
40  0  2  4  4

In [8]:
data1 = {
    'name':'John',
    'sex':'male',
    'age':22
}
data2 = {
    'name':'Zack',
    'sex':'male',
    'age':30
}
data3 = {
    'name':'Emily',
    'sex':'female',
    'age':32
}
pd.DataFrame([data1, data2, data3])

    name     sex  age
0   John    male   22
1   Zack    male   30
2  Emily  female   32

In [9]:
data1 = {
    'name':'John',
    'sex':'male',
    'age':22
}
data2 = {
    'name':'Zack',
    'sex':'male',
    'age':30
}
data3 = {
    'name':'Emily',
    'sex':'female',
    'age':32
}
pd.DataFrame([data1, data2, data3])

    name     sex  age
0   John    male   22
1   Zack    male   30
2  Emily  female   32

In [10]:
pd.read_csv('./titanic/train.csv')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### DataFrameの変数には’df’をよく使う¶
### 特に理由がなければDataFrameのオブジェクトに df という変数を使って操作することが多いです．なんのDataFrameかを明確にしたい時は, train_df や titanic_df とするとわかりやすいです．今回は df にします．(pdと似ているので注意. 私はよく間違えますw)

In [11]:
df = pd.read_csv('./titanic/train.csv')

In [12]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [13]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [14]:
type(df.describe())

pandas.core.frame.DataFrame

In [15]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

### ブラケット[]で特定のカラムだけ抜き出したSeriesを取得する

In [21]:
df['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [22]:
type(df['Age'])

pandas.core.series.Series

### ブラケット[]にカラムのリストを入れて複数のカラムをまとめて抽出する
##### df[‘Age’, ‘Parch’, ‘Fare’]ではないことに注意です．初学者がよくやるエラーだと思います

In [27]:
df[['Age', 'Parch', 'Fare']].head()

    Age  Parch     Fare
0  22.0      0   7.2500
1  38.0      0  71.2833
2  26.0      0   7.9250
3  35.0      0  53.1000
4  35.0      0   8.0500

In [23]:
df[['Age']].head()

    Age
0  22.0
1  38.0
2  26.0
3  35.0
4  35.0

### .iloc[int]で特定の行をSeriesで取得する
##### カラムの次は行です．.iloc[int]で特定の行をSeriesで取得できます．先ほどAgeのSeriesをみると888行目がNaNだったので888行目を取り出してみます．あとilocというのは変な名前ですが，index locationの略です．

In [24]:
df.iloc[888]

PassengerId                                         889
Survived                                              0
Pclass                                                3
Name           Johnston, Miss. Catherine Helen "Carrie"
Sex                                              female
Age                                                 NaN
SibSp                                                 1
Parch                                                 2
Ticket                                       W./C. 6607
Fare                                              23.45
Cabin                                               NaN
Embarked                                              S
Name: 888, dtype: object

In [29]:
df.iloc[888]['Age']
# columnとrawが入れ替わるとerrorになる

nan

In [30]:
np.isnan(df.iloc[888]['Age'])

True

In [30]:
df.iloc[888]['Age'] is None

False

##### みんな疑問に思う「なんでilocなの？普通にブラケットじゃだめなの？」について解説します．

理由はブラケットはカラムの取得に使うからです．以下のDataFrameで説明します．

In [33]:
np.random.seed(1)
ndarray = np.random.randint(10, size=(5, 5))
index = ['a', 'b', 'c', 'd', 'e']
columns = [0, 1, 2, 3, 4]
df = pd.DataFrame(data=ndarray, index=index, columns=columns)
df

   0  1  2  3  4
a  5  8  9  5  0
b  0  1  7  6  9
c  2  4  5  2  4
d  2  4  7  7  9
e  1  7  0  6  9

##### indexが文字列で，columnsが数値であることに注意してください．また，np.random.seed()で乱数のタネを指定しています．1を指定すればみなさんの環境でも同じDataFrameが生成されているはずです．

##### この場合，columnsが文字列ではなく数値なので，df[‘0’]ではなくてdf[0]でカラムのSeriesを取得します．（なのでindexを指定する時，つまり行を取得するときはilocという関数を使うのです．）

In [34]:
df[0]

a    5
b    0
c    2
d    2
e    1
Name: 0, dtype: int64

##### indexに文字列が指定されている場合は，iloc[数値]の他にloc[文字列]で特定の行のSeriesを取得できます．

In [38]:
df.loc['c']
# 今回はdf.iloc[3]でも同じ値が返ってくる

0    2
1    4
2    5
3    2
4    4
Name: c, dtype: int64

##### 基本はカラムは文字列，indexは数値になると思います．たまにindexにID（タイタニックでいうと PassengerId ）を指定することもありますが,行の取得にはほとんどの場合 .iloc[] を使います．私は滅多に loc[] は使わないです．

##### また，カラムはできるだけ意味のある文字列にしてください．意味を持たない数値はややこしいのでやめましょう．